БухЭксп/Catalogs/CW_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Оборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОтслеживаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОтслеживаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСлежения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыСлежения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСлежения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавлятьВКарточку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Оборудование/Ext/ManagerModule.bsl
Функция ПолучитьНаличиеОборудования(ПредставлениеОборудования) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_Оборудование.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Оборудование КАК CW_Оборудование
	               |ГДЕ
	               |	CW_Оборудование.Наименование = &ПредставлениеОборудования
	               |	И CW_Оборудование.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ПредставлениеОборудования", ПредставлениеОборудования);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьОборудованиеПоНаименованию(ПредставлениеОборудования) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_Оборудование.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Оборудование КАК CW_Оборудование
	               |ГДЕ
	               |	CW_Оборудование.Наименование = &ПредставлениеОборудования
	               |	И CW_Оборудование.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ПредставлениеОборудования", ПредставлениеОборудования);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.CW_Оборудование.ПустаяСсылка");
	
КонецФункции

Процедура ПоставитьОборудованиеНаСлеждение(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПараметрыСлежения = ПараметрыПроцедуры.ПараметрыСлежения;  
	
	ОтслеживаемоеОборудование = Новый Массив;
	
	Для Каждого Оборудование из ПараметрыПроцедуры.Оборудование Цикл  
		
		Наименование = Строка(Оборудование)+" ("+Строка(ПараметрыСлежения.ВариантСлежения)+", "+Формат(ПараметрыСлежения.НачалоСлежения,"ДЛФ=D")+")";
	
		ОбъектОтслеживаемоеОборудование = Справочники.CW_ОтслеживаемоеОборудование.СоздатьЭлемент();
		ОбъектОтслеживаемоеОборудование.Оборудование 		= Оборудование;   
		ОбъектОтслеживаемоеОборудование.Наименование 		= Наименование;   
		ОбъектОтслеживаемоеОборудование.ВариантСлежения 	= ПараметрыСлежения.ВариантСлежения;   
		ОбъектОтслеживаемоеОборудование.НачалоСлежения 		= ПараметрыСлежения.НачалоСлежения;   
		ОбъектОтслеживаемоеОборудование.ОкончаниеСлежения 	= ПараметрыСлежения.ОкончаниеСлежения;  
		
		//Параметры оборудования
		Для Каждого СтрокаПараметров из  Оборудование.ПараметрыГрузоперевозки Цикл 
			НоваяСтрока = ОбъектОтслеживаемоеОборудование.ПараметрыГрузоперевозки.Добавить();
			НоваяСтрока.Параметр			= СтрокаПараметров.Параметр;
			НоваяСтрока.Значение			= СтрокаПараметров.Значение;
			НоваяСтрока.Примечание			= СтрокаПараметров.Примечание;    
			НоваяСтрока.ХранилищеДанных		= Новый ХранилищеЗначения(СтрокаПараметров.ХранилищеДанных.Получить());
			НоваяСтрока.ДобавлятьВКарточку 	= Истина;
		КонецЦикла; 
		//---Параметры оборудования
		
		ОбъектОтслеживаемоеОборудование.Записать();  
		
		ОтслеживаемоеОборудование.Добавить(ОбъектОтслеживаемоеОборудование.Ссылка);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ОтслеживаемоеОборудование, АдресРезультата);  
	
КонецПроцедуры
